run/testInter/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-3;

vertices
(
    (0.0 0.0 -0.2)
    (1.5 0.0 -0.2)
    (1.5 0.5 -0.2)
    (0.0 0.5 -0.2)
    (0.0 0.0 0.1)
    (1.5 0.0 0.1)
    (1.5 0.5 0.1)
    (0.0 0.5 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (150 50 30) simpleGrading (1 1 1)
);

edges
(
);

dpatch wall;
boundary
(
    ymax
    {
        type $dpatch;
        faces
        (
            (2 6 7 3)
        );
    }
    xmin
    {
        type $dpatch;
        faces
        (
            (0 3 7 4)
        );
    }
    xmax
    {
        type $dpatch;
        faces
        (
            (1 2 6 5)
        );
    }
    ymin
    {
        type $dpatch;
        faces
        (
            (0 1 5 4)
        );
    }
    zmin
    {
        type $dpatch;
        faces
        (
            (0 1 2 3)
        );
    }
    zmax
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
